{
  "articles": [
    {
      "id": 10,
      "title": "Fallos en Picklescan permiten que modelos maliciosos de PyTorch evadan la detección",
      "content": [
        "Investigadores de seguridad de JFrog han descubierto tres vulnerabilidades críticas en Picklescan, una herramienta de código abierto diseñada para escanear modelos de machine learning de PyTorch en busca de código malicioso. Estos fallos permitirían a un atacante eludir por completo las comprobaciones de seguridad y ejecutar código arbitrario.",
        "Picklescan analiza archivos en formato 'pickle' de Python, un estándar utilizado por PyTorch para guardar y cargar modelos. El formato pickle es inherentemente riesgoso porque puede desencadenar la ejecución automática de código al deserializarse.",
        "La primera vulnerabilidad (CVE-2025-10155) es una omisión de escaneo basada en la extensión del archivo. Picklescan solo escaneaba archivos que terminaban en extensiones específicas como '.pt' o '.pth'. Un atacante podría renombrar un archivo pickle malicioso con una extensión no reconocida para evitar el análisis.",
        "La segunda (CVE-2025-10156) afecta al manejo de archivos ZIP. Si Picklescan encontraba un error al leer un archivo ZIP (por ejemplo, uno manipulado deliberadamente), detenía el escaneo de todo el archivo y lo marcaba como 'no escaneable' en lugar de peligroso, lo que podría usarse como una vía de omisión.",
        "La tercera (CVE-2025-10157) socava la verificación de 'globales' peligrosos. Picklescan intenta detectar el uso de funciones y módulos peligrosos. Esta vulnerabilidad permitiría a un atacante ofuscar o enmascarar estas importaciones para que no sean detectadas.",
        "En conjunto, estas fallas permitirían a un actor de amenazas empaquetar un modelo de PyTorch con una carga útil maliciosa, evadir la detección de Picklescan y comprometer el sistema de cualquier desarrollador o investigador que cargue el modelo. Esto representa un riesgo significativo para la cadena de suministro de la IA.",
        "JFrog divulgó estos hallazgos de manera responsable al mantenedor de Picklescan, Matthieu Maitre, quien lanzó correcciones en la versión 0.0.31 el 9 de septiembre de 2025. Se recomienda encarecidamente a todos los usuarios que actualicen a esta versión de inmediato.",
        "Este caso subraya un desafío más amplio en el ecosistema de IA: la seguridad a menudo va a la zaga de la innovación. A medida que frameworks como PyTorch se adoptan masivamente, las herramientas de protección deben ser igualmente robustas y estar sujetas a un escrutinio de seguridad continuo."
      ],
      "category": "Vulnerabilidades / IA",
      "source": "The Hacker News",
      "date": "2025-12-04",
      "image": "https://8upload.com/image/72d41d4708f2a7f0/IMG_20251204_132502_307.jpg",
      "url": "https://thehackernews.com/2025/12/picklescan-bugs-allow-malicious-pytorch.html"
    },
    {
      "id": 9,
      "title": "El botnet Aisuru rompe récord con un ataque DDoS de 29.7 Tbps",
      "content": [
        "Cloudflare ha reportado el ataque de denegación de servicio distribuido (DDoS) más grande jamás registrado, alcanzando la asombrosa cifra de 29.7 terabits por segundo (Tbps). El ataque, detectado y mitigado en septiembre de 2025, fue atribuido a un botnet masivo conocido como 'Aisuru'.",
        "El ataque fue hipervolumétrico, lo que significa que su objetivo principal era saturar el ancho de banda de la red objetivo. Los analistas de Cloudflare describieron la técnica como un 'bombardeo de alfombra UDP', donde el tráfico malicioso se dirige simultáneamente a un promedio de 15,000 puertos diferentes por segundo, haciendo que las defensas tradicionales basadas en puertos sean ineficaces.",
        "Cloudflare estima que el botnet Aisuru, cuyo nombre significa 'amar' en japonés, está compuesto por entre 1 y 4 millones de dispositivos infectados en todo el mundo. Esta red de bots se ofrece como un servicio de alquiler (DDoS-for-hire), permitiendo a actores maliciosos lanzar ataques de este calibre por solo unos pocos cientos o miles de dólares.",
        "El récord anterior para un ataque DDoS también lo tenía Cloudflare, con un ataque de 26 Tbps mitigado a principios de 2025. El rápido crecimiento en la escala y sofisticación de estos ataques subraya la necesidad crítica de que las organizaciones implementen soluciones de mitigación de DDoS robustas y en la nube.",
        "La empresa mitigó el ataque de 29.7 Tbps en solo 69 segundos, gracias a su red global y sistemas automatizados. Sin embargo, destacaron que en el tercer trimestre de 2025, Aisuru fue responsable de 1,304 ataques hipervolumétricos, lo que demuestra su actividad persistente y peligrosa.",
        "La recomendación para las organizaciones es clara: no confiar únicamente en las defensas on-premise. Una estrategia de seguridad que incluya una red de entrega de contenido (CDN) con capacidades de mitigación de DDoS integradas y a escala de nube es esencial para resistir estas amenazas modernas."
      ],
      "category": "DDoS / Botnets",
      "source": "The Hacker News",
      "date": "2025-12-03",
      "image": "https://8upload.com/image/d5a2c3db1be0f6c2/IMG_20251204_132844_103.jpg",
      "url": "https://thehackernews.com/2025/12/record-297-tbps-ddos-attack-linked-to.html"
    },
    {
      "id": 8,
      "title": "Vulnerabilidad crítica en WordPress King Addons bajo ataque activo",
      "content": [
        "Una vulnerabilidad de ejecución remota de código (RCE) de alta gravedad en el plugin premium de WordPress 'King Addons for Elementor' está siendo explotada activamente en la naturaleza, poniendo en riesgo a miles de sitios web.",
        "La falla, que no tiene un CVE asignado al momento del informe, es un problema de control de acceso que permite a un atacante subir archivos arbitrarios al servidor sin necesidad de autenticación. Esto puede llevar directamente a la ejecución de código PHP malicioso y al compromiso total del sitio.",
        "El plugin, desarrollado por WP Royal, es una suite de widgets y extensiones para el popular constructor de páginas Elementor. La vulnerabilidad afecta a todas las versiones desde la 1.0.0 hasta la 2.1.11.",
        "Los investigadores de seguridad que descubrieron la falla observaron intentos de explotación en la red apenas horas después de que se hiciera pública una prueba de concepto. Los atacantes están utilizando la vulnerabilidad para instalar backdoors, secuestradores de administrador y otros malware en sitios WordPress vulnerables.",
        "El desarrollador, WP Royal, lanzó una actualización de seguridad urgente, versión 2.1.12, que corrige la vulnerabilidad. Se insta a todos los usuarios del plugin King Addons a actualizar inmediatamente a esta última versión.",
        "Además de aplicar el parche, los administradores de sitios que puedan haber sido afectados deben escanear sus sitios en busca de archivos sospechosos recientemente subidos (especialmente en directorios de carga como `/wp-content/uploads/`) y revisar los registros de acceso y error de sus servidores en busca de actividad inusual.",
        "Este incidente sirve como un recordatorio crítico de la importancia de mantener todos los plugins y temas de WordPress actualizados, especialmente aquellos que ofrecen funcionalidades extendidas como la carga de archivos."
      ],
      "category": "WordPress / Vulnerabilidades",
      "source": "The Hacker News",
      "date": "2025-12-03",
      "image": "https://8upload.com/image/38063f85b54b6534/IMG_20251204_133006_570.jpg",
      "url": "https://thehackernews.com/2025/12/wordpress-king-addons-flaw-under-active.html"
    },
    {
      "id": 7,
      "title": "Microsoft parchea silenciosamente fallo crítico de Windows LNK",
      "content": [
        "Microsoft ha corregido una vulnerabilidad crítica en el manejo de archivos de acceso directo de Windows (.LNK) sin emitir un boletín de seguridad formal, un movimiento que ha llamado la atención de la comunidad de seguridad.",
        "La vulnerabilidad, similar en naturaleza a la explotada por el gusano Stuxnet en 2010, reside en el proceso de análisis de los archivos LNK. Un atacante podría crear un acceso directo malicioso que, al ser visualizado por el usuario en el Explorador de Windows o en el escritorio (sin necesidad de hacer clic), desencadenaría la ejecución de código arbitrario en el sistema.",
        "El peligro de este tipo de fallo es su 'interacción cero'. La mera acción de que Windows intente mostrar el icono del acceso directo (al navegar por una carpeta compartida en la red, por ejemplo, o al abrir un dispositivo USB infectado) sería suficiente para comprometer la máquina.",
        "La actualización que contiene el parche fue lanzada como parte de las actualizaciones acumulativas de seguridad regulares de Windows en noviembre de 2025. Sin embargo, a diferencia de otras vulnerabilidades críticas, Microsoft no asignó un identificador CVE (Common Vulnerabilities and Exposures) ni proporcionó detalles técnicos en su centro de seguridad.",
        "Expertos en seguridad especulan que la razón para este 'parche silencioso' podría ser evitar atraer atención no deseada hacia la vulnerabilidad antes de que una gran parte de la base de usuarios de Windows haya aplicado la actualización, dada la facilidad de explotación.",
        "Este enfoque, aunque comprensible desde un punto de vista de contención, ha sido criticado por algunos por falta de transparencia. Los administradores de sistemas y usuarios deben asegurarse de que sus sistemas Windows estén configurados para recibir e instalar actualizaciones automáticamente, ya que esta es la única defensa confirmada contra esta amenaza sigilosa."
      ],
      "category": "Windows / Vulnerabilidades",
      "source": "The Hacker News",
      "date": "2025-12-03",
      "image": "https://8upload.com/image/220a4f3e5c28a7d4/IMG_20251204_133133_760.jpg",
      "url": "https://thehackernews.com/2025/12/microsoft-silently-patches-windows-lnk.html"
    },
    {
      "id": 6,
      "title": "Brasil afectado por un troyano bancario propagado a través de Google Ads",
      "content": [
        "Una sofisticada campaña de malware está apuntando a usuarios brasileños mediante la técnica de 'malvertising' (publicidad maliciosa), abusando de la plataforma Google Ads para distribuir un nuevo troyano bancario.",
        "Los atacantes compran espacios publicitarios en Google que aparecen como resultados destacados cuando las víctimas buscan software financiero legítimo, como aplicaciones de bancos importantes (Itaú, Bradesco, Nubank) o plataformas de criptomonedas (Mercado Bitcoin, Foxbit).",
        "Al hacer clic en estos anuncios, los usuarios son llevados a sitios web falsos que imitan perfectamente las páginas oficiales de descarga. Estos sitios ofrecen instaladores que, además del software legítimo, contienen el troyano bancario oculto.",
        "Una vez instalado, el malware posee capacidades extensas: roba credenciales bancarias ingresadas en el navegador o en aplicaciones nativas, intercepta mensajes SMS de autenticación de dos factores (2FA), y puede incluso realizar transferencias fraudulentas de fondos de forma automática, todo mientras se mantiene oculto para el usuario.",
        "La campaña es notable por su precisión geográfica y su uso de anuncios pagados en una plataforma de confianza como Google, lo que aumenta enormemente la probabilidad de que las víctimas hagan clic. También utiliza técnicas de evasión para evitar el análisis por parte de soluciones de seguridad.",
        "Los investigadores recomiendan a los usuarios ser extremadamente cautelosos al descargar cualquier software financiero. En lugar de hacer clic en anuncios, deben ir directamente al sitio web oficial de la institución escribiendo la URL manualmente en el navegador. Además, el uso de herramientas de seguridad que puedan detectar y bloquear redirecciones maliciosas es crucial.",
        "Google ha sido notificado sobre los anuncios maliciosos y presumiblemente los ha retirado, pero la naturaleza dinámica de estas campañas significa que otras similares pueden surgir en cualquier momento."
      ],
      "category": "Malware / Troyanos",
      "source": "The Hacker News",
      "date": "2025-12-02",
      "image": "https://8upload.com/image/d96b628954ce509a/IMG_20251204_133241_769.jpg",
      "url": "https://thehackernews.com/2025/12/brazil-hit-by-banking-trojan-spread-via.html"
    },
    {
      "id": 5,
      "title": "Descubre las herramientas de IA que impulsan la próxima generación de ciberataques",
      "content": [
        "La inteligencia artificial generativa (GenAI) no es solo una herramienta para defensores; los actores de amenazas la están adoptando rápidamente para crear ciberataques más convincentes, automatizados y difíciles de detectar.",
        "Una de las aplicaciones más inmediatas es la creación de correos de phishing y mensajes de ingeniería social. Los modelos de lenguaje grande (LLMs) pueden generar textos perfectamente redactados, sin los errores gramaticales y ortográficos que tradicionalmente los delataban, y pueden hacerlo en múltiples idiomas y a una escala masiva. También pueden personalizar los mensajes raspando información pública de las redes sociales de las víctimas.",
        "Más allá del texto, la IA se utiliza para crear 'deepfakes' de audio convincentes para ataques de suplantación de voz (vishing), donde un empleado podría recibir una llamada que suena exactamente como su jefe solicitando una transferencia urgente de fondos.",
        "En el lado técnico, los atacantes están experimentando con LLMs especializados en código para generar variantes de malware, exploits o scripts de automatización de ataques, reduciendo la barrera de entrada para actores menos técnicos.",
        "La IA también optimiza los propios ataques. Puede analizar grandes conjuntos de datos robados para identificar objetivos de alto valor, probar automáticamente diferentes vectores de ataque contra un sistema, o generar tráfico de botnets que imite el comportamiento humano para evadir sistemas de detección de DDoS.",
        "Para defenderse, la industria de la seguridad debe contraatacar con IA. Esto incluye el uso de modelos para analizar el comportamiento de usuarios y entidades (UEBA) en busca de anomalías, escanear comunicaciones en busca de patrones lingüísticos sospechosos generados por máquinas, y automatizar la respuesta a incidentes para contener brechas más rápido.",
        "El futuro del ciberconflicto será una carrera de armamentos impulsada por IA. La ventaja no la tendrá necesariamente quien tenga la IA más poderosa, sino quien la integre de manera más efectiva y ética en su ciclo de operaciones de seguridad."
      ],
      "category": "IA / Ciberamenazas",
      "source": "The Hacker News",
      "date": "2025-12-02",
      "image": "https://8upload.com/image/1efc3a4a2a6de1c1/IMG_20251204_133706_437.jpg",
      "url": "https://thehackernews.com/2025/12/discover-ai-tools-fueling-next.html"
    },
    {
      "id": 4,
      "title": "Reduciendo la IA a su justa medida: convertir gigantes en herramientas eficientes",
      "content": [
        "Frente a los enormes costos computacionales y ambientales de los modelos de IA masivos como GPT-4, una tendencia crucial está ganando impulso: la 'eficientización' (eficiency) de la IA, es decir, hacer modelos más pequeños, rápidos y frugales sin sacrificar capacidad.",
        "La técnica de la **cuantización** es fundamental. Reduce la precisión de los números utilizados en los cálculos del modelo (por ejemplo, de coma flotante de 32 bits a enteros de 8 bits). Esto puede reducir drásticamente el tamaño del modelo y la energía necesaria para ejecutarlo, con una pérdida mínima de precisión en muchas tareas.",
        "La **poda de modelos** (model pruning) identifica y elimina conexiones neuronales ('pesos') que contribuyen poco al resultado final. El modelo resultante es más esbelto y puede ejecutarse más rápido, a menudo con una precisión comparable al modelo original denso.",
        "La **destilación de conocimiento** (knowledge distillation) entrena a un modelo pequeño ('estudiante') para imitar el comportamiento de un modelo grande y complejo ('maestro'). El estudiante aprende la esencia del conocimiento del maestro, logrando un rendimiento similar con una fracción de los parámetros.",
        "Estas técnicas están permitiendo la **IA en el dispositivo** (on-device AI). Modelos potentes pueden ahora ejecutarse directamente en teléfonos inteligentes, sensores IoT o dispositivos médicos portátiles, lo que permite aplicaciones en tiempo real, con mayor privacidad (los datos no salen del dispositivo) y sin dependencia de la nube.",
        "Empresas como Google (con modelos móviles como MobileNet), Apple (con chips Neural Engine) y una miríada de startups están liderando esta carrera. El impacto es doble: democratiza el acceso a la IA de alto nivel para empresas con recursos limitados y reduce significativamente la huella de carbono de la industria tecnológica.",
        "El artículo concluye que el futuro no está necesariamente en modelos cada vez más grandes, sino en modelos más inteligentemente diseñados. La eficiencia será la próxima frontera de la innovación en IA."
      ],
      "category": "IA / Tecnología",
      "source": "The Hacker News",
      "date": "2025-12-02",
      "image": "https://8upload.com/image/bd0bd65ebe976996/IMG_20251204_133818_281.jpg",
      "url": "https://thehackernews.com/2025/12/chopping-ai-down-to-size-turning.html"
    },
    {
      "id": 3,
      "title": "Más allá del ROI puntual: El caso de la seguridad continua en la nube",
      "content": [
        "En el mundo de la infraestructura en la nube, donde los recursos se crean, escalan y destruyen en minutos, los modelos tradicionales de seguridad y medición de retorno de la inversión (ROI) están obsoletos. Un artículo de análisis argumenta a favor de un paradigma de 'seguridad continua'.",
        "El problema central es la **ephemeralidad**. Un servidor vulnerable puede existir solo durante una hora para una tarea de procesamiento de datos. Una política de seguridad errónea puede propagarse automáticamente a cientos de contenedores nuevos. Medir el ROI de una herramienta de seguridad en un 'punto en el tiempo' específico no captura su valor en este entorno dinámico.",
        "El artículo propone cambiar a métricas de valor continuo. En lugar de '¿evitamos un ataque este trimestre?', preguntar '**¿cuál es nuestro tiempo medio de remediación (MTTR) para configuraciones inseguras?**' o '**¿en qué porcentaje hemos reducido nuestra superficie de ataque promedio en los últimos 90 días?**'.",
        "La solución técnica es la **orquestación de seguridad como código** (Security as Code). Las políticas de seguridad (como reglas de grupos de seguridad, requisitos de cifrado o configuraciones de cumplimiento) se definen en archivos de código (como Terraform o políticas de AWS). Estas políticas se aplican automáticamente a cada recurso nuevo que se crea, garantizando que la seguridad sea inherente y no un parche posterior.",
        "Este enfoque requiere un cambio cultural hacia **'shift-left'** en la seguridad de la nube. Los equipos de desarrollo y operaciones (DevOps) deben integrar las comprobaciones de seguridad desde las primeras etapas del diseño de la infraestructura, y los equipos de seguridad deben actuar como facilitadores que crean plantillas y políticas seguras reutilizables.",
        "El ROI real de la seguridad continua en la nube no es un número en una hoja de cálculo de un trimestre, sino la **reducción del riesgo operacional y financiero a largo plazo**. Se traduce en evitar multas por incumplimiento normativo, prevenir paralizaciones costosas por incidentes de seguridad y mantener la confianza del cliente en un entorno donde un error de configuración puede ser noticia mundial en horas.",
        "Concluye que invertir en seguridad continua no es un gasto, sino un habilitador esencial para la agilidad y resiliencia empresarial en la era de la nube."
      ],
      "category": "Cloud / Estrategia",
      "source": "The Hacker News",
      "date": "2025-12-02",
      "image": "https://8upload.com/image/f10207e0231246ec/IMG_20251204_133937_678.jpg",
      "url": "https://thehackernews.com/expert-insights/2025/12/beyond-point-in-time-roi-case-for.html"
    },
    {
      "id": 2,
      "title": "Fallos críticos de RSC en React y Next.js",
      "content": [
        "Se han descubierto vulnerabilidades de gravedad crítica en la implementación de Componentes del Lado del Servidor (RSC) de React y su framework Next.js. Estas fallas podrían permitir a atacantes ejecutar código malicioso en el servidor, comprometiendo la lógica de la aplicación y los datos sensibles.",
        "React Server Components es una arquitectura moderna que permite renderizar componentes React directamente en el servidor, prometiendo mejor rendimiento y capacidades. Sin embargo, la complejidad de manejar datos serializados entre servidor y cliente ha introducido nuevos vectores de ataque.",
        "Las vulnerabilidades específicas, cuyos detalles técnicos completos se mantienen bajo embargo para permitir una parcheo generalizado, giran en torno a la **inyección de objetos maliciosos durante el proceso de serialización/deserialización (serde)**. Un atacante podría manipular los 'props' (propiedades) de un componente para inyectar código que se ejecute en el contexto del servidor durante el renderizado.",
        "El impacto es severo: **ejecución remota de código (RCE) en el servidor backend**. Esto podría llevar al robo de secretos de aplicación, bases de datos de usuarios, manipulación de respuestas HTML para inyectar malware en las páginas de los clientes, o la toma de control completa del servidor que aloja la aplicación.",
        "Las versiones afectadas incluyen ciertas builds de Next.js que implementan RSC de formas avanzadas. El equipo de Vercel (creadores de Next.js) y los mantenedores de React han sido notificados y han lanzado parches de seguridad urgentes en las versiones estables más recientes.",
        "La recomendación para todos los desarrolladores que utilizan **Next.js con App Router y React Server Components es actualizar de inmediato** a la última versión estable disponible. Además, se debe revisar la documentación oficial sobre prácticas seguras para pasar datos a los componentes del servidor y evitar la serialización de objetos de usuario no confiables.",
        "Este incidente resalta los riesgos de seguridad que pueden emerger con las nuevas y poderosas abstracciones en el desarrollo web. Mientras la industria adopta estas tecnologías para mejorar la experiencia del usuario, un escrutinio de seguridad igualmente intenso debe acompañar su desarrollo y despliegue."
      ],
      "category": "Web / Vulnerabilidades",
      "source": "The Hacker News",
      "date": "2025-12-01",
      "image": "https://8upload.com/image/9ae7235df4537bcd/IMG_20251204_134200_595.jpg",
      "url": "https://thehackernews.com/2025/12/critical-rsc-bugs-in-react-and-nextjs.html"
    },
    {
      "id": 1,
      "title": "Una caja maliciosa de Rust distribuye malware específico del sistema operativo a los sistemas de desarrolladores Web3.",
      "content": [
        "Investigadores de ciberseguridad han descubierto un paquete Rust malicioso que puede atacar sistemas Windows, macOS y Linux y que cuenta con una funcionalidad maliciosa para ejecutarse sigilosamente en máquinas de desarrolladores haciéndose pasar por una herramienta auxiliar de unidad de máquina virtual Ethereum (EVM).",
        "El paquete de Rust, llamado 'evm-units', fue subido a crates.io a mediados de abril de 2025 por el usuario 'ablerust', y recibió más de 7000 descargas en los últimos ocho meses. Otro paquete creado por el mismo autor, 'uniswap-utils', incluía 'evm-units' como dependencia. Se descargó más de 7400 veces. Desde entonces, los paquetes se han eliminado del repositorio.",
        "Según el sistema operativo de la víctima y si el antivirus Qihoo 360 está activo, el paquete descarga una carga útil, la escribe en el directorio temporal del sistema y la ejecuta silenciosamente, explicó la investigadora de seguridad de Socket, Olivia Brown, en un informe. 'El paquete parece devolver el número de versión de Ethereum, por lo que la víctima no se da cuenta'.",
        "Un aspecto notable del paquete es que está diseñado explícitamente para verificar la presencia del proceso 'qhsafetray.exe', un archivo ejecutable asociado con 360 Total Security, un software antivirus desarrollado por el proveedor de seguridad chino Qihoo 360.",
        "Específicamente, el paquete está diseñado para invocar una función aparentemente inofensiva llamada 'get_evm_version()', que decodifica y accede a una URL externa ('download.videotalks[.]xyz') para obtener una carga útil de la siguiente etapa dependiendo del sistema operativo en el que se esté ejecutando.",
        "En Linux, descarga un script, lo guarda en /tmp/init y lo ejecuta en segundo plano utilizando el comando nohup, lo que permite al atacante obtener control total.",
        "En macOS, descarga un archivo llamado init y lo ejecuta usando osascript en segundo plano con el comando nohup.",
        "En Windows, descarga y guarda la carga útil como un archivo de script de PowerShell ('init.ps1') en el directorio temporal y verifica los procesos en ejecución en busca de 'qhsafetray.exe' antes de invocar el script. Si el proceso no está presente, crea un contenedor de script de Visual Basic que ejecuta un script de PowerShell oculto sin ventana visible. Si se detecta el proceso antivirus, modifica ligeramente su flujo de ejecución invocando directamente PowerShell.",
        "'Este enfoque en Qihoo 360 es un indicador poco común y explícito de una estrategia dirigida a China, ya que se trata de una empresa china líder en internet', afirmó Brown. 'Encaja con el perfil de robo de criptomonedas, ya que Asia es uno de los mayores mercados globales para la actividad minorista de criptomonedas'.",
        "Las referencias a EVM y Uniswap, un protocolo de intercambio de criptomonedas descentralizado creado en la cadena de bloques Ethereum, indican que el incidente de la cadena de suministro está diseñado para apuntar a los desarrolladores en el espacio Web3 haciendo pasar los paquetes como utilidades relacionadas con Ethereum.",
        "'Ablerust, el actor de amenazas responsable del código malicioso, integró un cargador multiplataforma de segunda etapa dentro de una función aparentemente inofensiva', declaró Brown. 'Peor aún, la dependencia se integró en otro paquete ampliamente utilizado (uniswap-utils), lo que permitió que el código malicioso se ejecutara automáticamente durante la inicialización'."
      ],
      "category": "Malware",
      "source": "The Hacker News",
      "date": "2025-12-01",
      "image": "https://8upload.com/image/d42511bdf8da6870/IMG_20251203_041541_676.jpg",
      "url": "https://thehackernews.com"
    }
  ]
}
